/* Визначити клас "Numeral_8", членом якого є вісімкове число. Реалізувати для даного класу декілька 
конструкторів, геттери, методи перетворення числа у двійкове, у тому числі і скороченим способом. 
Перевантажити оператори: префіксний "++" - для інкрементації вісімкового числа, "+=" - для збільшення 
його на вказану величину, "+" - для додавання двох вісімкових чисел. Створити три вісімкових числа 
(N1, N2, N3), використовуючи різні конструктори. Інкрементувати число N1, а число N2 збільшити на
вказану величину. Знайти суму змінених чисел N1 та N2 і зберегти її в N3. Перевести отримане значення 
N3 у двійковий формат двома способами (звичайним і скороченим). */

#include "Functions.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "russian");
	long long n1;
	cout << "Введiть вiсiмкове число N1: "; cin >> n1;
	while (!isNumeral8(n1)) {
		cout << "Ви ввели число, що не вiдповiдає вiсiмковiй СЧ! Введiть N1 ще раз: "; cin >> n1;
	}
	Numeral_8 N1(n1), N2(N1), N3;
	cout << "\nПоточнi данi:";
	outputNums(N1, N2, N3);

	long long n;
	cout << "\nВведiть величину, на яку ви бажаєте збiльшити N2 (вiсiмкова СЧ): "; cin >> n;
	while (!isNumeral8(n)) {
		cout << "Ви ввели число у невiрнiй системi числення! Спробуйте ще раз: "; cin >> n;
	}
	++N1;
	N2 += n;
	N3 = N1 + N2;
	cout << "\nЗмiненi данi:";
	outputNums(N1, N2, N3);
	cout << "\nN3, конвертоване у двiйкову СЧ звичайним способом:  " << N3.convertToBinUsual();
	cout << "\nN3, конвертоване у двiйкову СЧ скороченим способом: " << N3.convertToBinReduced() << "\n\n";
	system("pause");
	return 0;
}