/* Визначити клас "Numeral_8", членом якого є вісімкове число. Реалізувати для даного класу декілька 
конструкторів, геттери, методи перетворення числа у двійкове, у тому числі і скороченим способом. 
Перевантажити оператори: префіксний "++" - для інкрементації вісімкового числа, "+=" - для збільшення 
його на вказану величину, "+" - для додавання двох вісімкових чисел. Створити три вісімкових числа 
(N1, N2, N3), використовуючи різні конструктори. Інкрементувати число N1, а число N2 збільшити на
вказану величину. Знайти суму змінених чисел N1 та N2 і зберегти її в N3. Перевести отримане значення 
N3 у двійковий формат двома способами (звичайним і скороченим). */

#define _CRT_SECURE_NO_WARNINGS
#include "Functions.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "russian");
	int n1, n2;
	cout << "Введiть вiсiмкове число N1: "; cin >> oct >> n1;
	cout << "Введiть вiсiмкове число N2: "; cin >> oct >> n2;
	Numeral_8 N1(n1);
	Numeral_8 N2(n2);
	Numeral_8 N3;
	cout << "\nN1 та N2 у вiсiмковiй СЧ:\n" << oct << N1.GetNum() << endl << oct << N2.GetNum() << endl;
	cout << "\nN1 та N2 у десятковiй СЧ:\n" << dec << N1.GetNum() << endl << dec << N2.GetNum() << endl;
	int n;
	cout << "Введiть n: "; 
	cin >> oct >> n;
	++N1;
	N2 += n;
	cout << "\n++N1: " << oct << N1.GetNum();
	cout << "\nN2 += n: " << oct << N2.GetNum();
	N3 = N1 + N2;
	cout << "\nN1 + N2 = " << oct << N3.GetNum() << endl;

	system("pause");
	return 0;
}