/* Визначити клас "Numeral_8", членом якого є вісімкове число. Реалізувати для даного класу декілька
конструкторів, геттери, методи перетворення числа у двійкове, у тому числі і скороченим способом.
Перевантажити оператори: префіксний "++" - для інкрементації вісімкового числа, "+=" - для збільшення
його на вказану величину, "+" - для додавання двох вісімкових чисел. Створити три вісімкових числа
(N1, N2, N3), використовуючи різні конструктори. Інкрементувати число N1, а число N2 збільшити на
вказану величину. Знайти суму змінених чисел N1 та N2 і зберегти її в N3. Перевести отримане значення
N3 у двійковий формат двома способами (звичайним і скороченим). */

#include "Functions.h"
using namespace std;

